{
  "versions": [
    {
      "version": "2.1.6.11",
      "releaseDate": "October 23, 2025",
      "newFeatures": [
        {
          "text": "8-Bit Operations Chapter - Brand new educational chapter with 12 progressive levels! Learn to build multi-bit circuits from the ground up, starting with simple 8-bit wire and culminating in a complete 8-bit ALU (Arithmetic Logic Unit). Each level builds on the previous, teaching you to create Splitters, 8-bit NOT/AND/OR gates, Multiplexers, Adders with carry logic, and finally a functional ALU capable of multiple operations.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Chip Description Viewer - View detailed descriptions for all built-in chips! Tap the info button in the chip library to access educational information, usage examples, and technical details. Note: Chip descriptions are a work in progress and will be expanded in future updates.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Hexagon Grid Option - Choose your aesthetic! New grid type preference in Settings > Display allows you to switch between the classic square grid and a beautiful hexagon honeycomb grid. The hexagon grid uses proper mathematical tessellation with point-top hexagons, creating a seamless honeycomb pattern that scales perfectly at all zoom levels. Your preference is saved with your project and persists across sessions.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Hall of Fame - Celebrate your achievements! New Hall of Fame view showcases global leaderboard champions and your personal accomplishments across all levels. Three main views: 'Top Players' shows the top 20 global competitors with their total scores, levels completed, and championship counts; 'Your Stats' displays your personal achievements including levels completed, average ranking, best scores, and detailed breakdown per level; 'Level Records' highlights the top 3 champions for each individual level with gold/silver/bronze medals. Accessible from the levels menu. See who's dominating the leaderboards, track your progress, and get motivated to improve your scores! 🏆",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Username Authentication System - Your leaderboard identity is now secure! Each device gets a unique authentication token, allowing you to claim a username that's permanently tied to your device. No more impersonation - only you can post scores under your name. You can change your username anytime through a simple confirmation dialog, and all your existing leaderboard entries automatically migrate to your new name.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "ROM Editor Graphical Mode - Revolutionary new way to edit ROM data! Click individual bits to toggle them on/off using intuitive colored dots (red for high, dark for low). Visual grid pattern makes it easy to track bits. Works seamlessly alongside text-based modes (Binary, HEX, Decimal).",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Eraser Tool (Mobile) - Toggleable eraser mode for rapid circuit cleanup! Tap the always-visible trash icon to activate eraser mode, then drag your finger over components/wires to delete them continuously. Two modes available: 'Delete All' removes everything you touch, 'Wires Only' preserves components. Tap the top banner to switch modes. Camera panning disabled while erasing to prevent accidents. Huge productivity boost for mobile editing!",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Discord Rich Presence (PC) - Show off your Digital Logic Sim activity on Discord! Enable 'Discord Status' in Settings to display your current activity to friends. Shows what level you're playing, whether you're building circuits or running simulations, and your current progress. Perfect for sharing your learning journey and connecting with other DLS players on Discord. PC-only feature that integrates seamlessly with Discord's Rich Presence system.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Custom Chip Shapes - Create chips with custom visual shapes! Design unique chip appearances to match your preferences or circuit organization needs. Note: This feature is experimental and not fully tested yet. Feedback welcome as we continue to refine it!",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Advanced Speaker Chip - New enhanced audio output component! The Speaker chip provides sophisticated sound generation beyond the basic buzzer. Features include multi-bit audio input for richer sound, additional control options for wave types and envelopes, improved volume control with finer granularity, and potential for chord/harmony generation. Perfect for creating complex audio circuits and learning about digital-to-analog conversion and sound synthesis concepts.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "TextDisplay Chip - Revolutionary new component that displays programmable text strings! The TextDisplay chip takes an 8-bit input (0-255) and displays the corresponding text from its 256 programmable string slots. The chip's displayed name updates in real-time based on the input value, enabling dynamic labeled states like 'IDLE' → 'RUNNING' → 'ERROR'. Perfect for state machines, circuit debugging, and visual feedback. Edit all 256 text entries through an intuitive ROM-style editor with presets and copy/paste functionality. Teaches lookup tables, memory-mapped displays, and character encoding concepts.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "improvements": [
        {
          "text": "Chip Library Preview Fixes - No more cut-off chip names! Chip previews now calculate proper bounds to ensure all text and components are fully visible in thumbnails. Custom chip names wrap and truncate properly with ellipsis (...) when needed. Consistent preview rendering across chip library, collections, search results, and all other contexts.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Two-Finger Panning During Wire Placement (Mobile) - No more accidental camera panning while routing wires! During wire placement, single-finger drags now only interact with wire points and pins - the camera stays put. To pan the camera while placing a wire, use two fingers. This eliminates the most frustrating aspect of mobile wire routing and makes placement precise and smooth.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Wire Placement Banner (Mobile) - New top-screen banner appears when placing wires showing 'Placing Wire' status and current straight wires mode. Tap the banner to toggle straight wires override on/off (mobile equivalent of holding Shift on PC). Banner shows yellow tint when override is active. Respects your straight wires preference setting - if preference forces straight wires, banner shows 'ON (pref)' and isn't clickable. Provides clear visual feedback and desktop-parity control for mobile wire routing.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Trash Can Exits Wire Placement (Mobile) - Pressing the trash icon while placing a wire now cancels wire placement mode, providing an intuitive way to exit wire routing. Outside wire placement, trash icon continues to toggle eraser mode as before.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "ROM Output Configuration - ROM chips now support multiple output configurations! Easily toggle between different output bit widths to match your circuit needs. Available configurations include 1×16, 2×8, 4×4, 8×2, and 16×1 bit outputs.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Level Mode Chip Restrictions - Special chips (ROM, displays, pulse generators, clocks, buttons, etc.) are now disabled in level mode to maintain educational focus. Players must build circuits from fundamental logic gates (NAND, tri-state buffers) and basic components. Custom user chips remain available. Prevents trivial solutions and ensures fair leaderboard comparisons while promoting deeper understanding of digital logic design.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Input State Preservation - Level validation now preserves your circuit's input states! After running validation tests, your input pins return to exactly how they were before you clicked 'Validate'. No more confusing randomly flipped inputs - the circuit looks exactly as you left it, while still showing accurate test results. This improves the polish and makes validation feel seamless.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "bugFixes": []
    },
    {
      "version": "2.1.6.10",
      "releaseDate": "2025-10-12",
      "newFeatures": [],
      "improvements": [
        {
          "text": "Fixed Chip Library Navigation - Improved navigation in Chip Library Menu with consistent selection states, proper focus management, and intuitive movement between starred items, collections, and nested folders",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Level validation popup improvements - Test results now scroll properly for complex circuits",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "bugFixes": [
        {
          "text": "CRITICAL: Fixed bit order bug in level validation - Resolved game-breaking bug where inputs/outputs were being reversed during validation, affecting all 26 levels. Game now correctly validates solutions.",
          "userFacing": true,
          "editNotes": ""
        }
      ]
    },
    {
      "version": "2.1.6.9",
      "releaseDate": "2025-10-09",
      "newFeatures": [
        {
          "text": "Drag and Drop Control Scheme - New intuitive chip placement mode. Simply drag chips from the bottom bar and drop them directly onto the canvas. Toggle between classic 'Drag and Lock' and new 'Drag and Drop' modes in preferences.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Hierarchical Collection Organization - Create and manage sub folders within collections for better chip organization.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "PC Version - Full mobile features now available on PC with mouse and keyboard support.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Solution Sharing - Upload and view complete solutions from leaderboard entries.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "User Names - Add custom names when uploading scores to leaderboards.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "iOS Platform Support - Full iOS support with project import/export and Firebase integration.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Patch Notes Popup - View 'What's New' directly from the About menu! See recent features, improvements, and bug fixes with color-coded sections. Easy to navigate with version selection and scrollable content.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "improvements": [
        {
          "text": "PC Firebase Integration - Full Firebase functionality now works on PC builds (Windows, macOS, Linux). PC users can now upload scores, view leaderboards, share solutions, and set user names just like mobile users. All online features are now available across all platforms.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Enhanced Level System - Expanded with more challenging levels and progressive difficulty.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Improved UI Navigation - Better folder browsing and collection management.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Clearer Score Explanation - Updated scoring information to better explain how nested NAND gates are counted.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Auto-Open Edit Tool - Single component selected + wrench press now automatically opens the edit menu.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "bugFixes": [
        {
          "text": "Fixed iOS file picker for importing project zip files. Various stability improvements and performance optimizations.",
          "userFacing": true,
          "editNotes": ""
        }
      ]
    }
  ]
}
