{
  "versions": [
    {
      "version": "2.1.6.11",
      "releaseDate": "TBD",
      "newFeatures": [
        {
          "text": "ROM Editor Graphical Mode - Revolutionary new way to edit ROM data! Click individual bits to toggle them on/off using intuitive colored dots (red for high, dark for low). Visual grid pattern makes it easy to track bits. Works seamlessly alongside text-based modes (Binary, HEX, Decimal).",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Eraser Tool (Mobile) - Toggleable eraser mode for rapid circuit cleanup! Tap the always-visible trash icon to activate eraser mode, then drag your finger over components/wires to delete them continuously. Two modes available: 'Delete All' removes everything you touch, 'Wires Only' preserves components. Tap the top banner to switch modes. Camera panning disabled while erasing to prevent accidents. Huge productivity boost for mobile editing!",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "improvements": [
        {
          "text": "Unified ROM Visibility and Naming - ROM chips now display with clear, consistent labeling throughout the game. The chip library shows a single 'ROM 256×16' entry instead of multiple confusing variants. Every ROM chip displays a two-line label showing 'ROM' on the first line and its active configuration on the second (e.g., '256×(2x8)', '256×(1x16)', '256×(16x1)', '256×(4x4)'). Freshly spawned ROMs default to '256×(2x8)' and automatically update their labels after editing. This eliminates confusion between editor and runtime views, prevents chip library duplication, and makes it instantly clear what configuration each ROM is using.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "ROM Editor Mobile Optimization - Enhanced ROM editing with mobile-first design: larger touch-friendly buttons, vertical layout for easy access, row selection system (click row numbers to select), context-aware Fill 0s/Fill 1s operations, optimized spacing and responsive layout for all screen sizes.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Level Mode Chip Restrictions - Special chips (ROM, displays, pulse generators, clocks, buttons, etc.) are now disabled in level mode to maintain educational focus. Players must build circuits from fundamental logic gates (NAND, tri-state buffers) and basic components. Custom user chips remain available. Prevents trivial solutions and ensures fair leaderboard comparisons while promoting deeper understanding of digital logic design.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Draggable Scroll Views - All scrollable lists and menus now support mobile-style content dragging! Simply touch/click anywhere in the content area and drag to scroll - no need to target the tiny scrollbar. Works in ROM editor, chip library, search results, levels menu, leaderboards, patch notes, and everywhere else. Natural mobile app experience with smart threshold to prevent accidental scrolling. Scrollbar and mouse wheel still work as before.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "bugFixes": []
    },
    {
      "version": "2.1.6.10",
      "releaseDate": "2025-10-12",
      "newFeatures": [],
      "improvements": [
        {
          "text": "Fixed Chip Library Navigation - Improved navigation in Chip Library Menu with consistent selection states, proper focus management, and intuitive movement between starred items, collections, and nested folders",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Level validation popup improvements - Test results now scroll properly for complex circuits",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "bugFixes": [
        {
          "text": "CRITICAL: Fixed bit order bug in level validation - Resolved game-breaking bug where inputs/outputs were being reversed during validation, affecting all 26 levels. Game now correctly validates solutions.",
          "userFacing": true,
          "editNotes": ""
        }
      ]
    },
    {
      "version": "2.1.6.9",
      "releaseDate": "2025-10-09",
      "newFeatures": [
        {
          "text": "Drag and Drop Control Scheme - New intuitive chip placement mode. Simply drag chips from the bottom bar and drop them directly onto the canvas. Toggle between classic 'Drag and Lock' and new 'Drag and Drop' modes in preferences.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Hierarchical Collection Organization - Create and manage sub folders within collections for better chip organization.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "PC Version - Full mobile features now available on PC with mouse and keyboard support.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Solution Sharing - Upload and view complete solutions from leaderboard entries.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "User Names - Add custom names when uploading scores to leaderboards.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "iOS Platform Support - Full iOS support with project import/export and Firebase integration.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Patch Notes Popup - View 'What's New' directly from the About menu! See recent features, improvements, and bug fixes with color-coded sections. Easy to navigate with version selection and scrollable content.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "improvements": [
        {
          "text": "PC Firebase Integration - Full Firebase functionality now works on PC builds (Windows, macOS, Linux). PC users can now upload scores, view leaderboards, share solutions, and set user names just like mobile users. All online features are now available across all platforms.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Enhanced Level System - Expanded with more challenging levels and progressive difficulty.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Improved UI Navigation - Better folder browsing and collection management.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Clearer Score Explanation - Updated scoring information to better explain how nested NAND gates are counted.",
          "userFacing": true,
          "editNotes": ""
        },
        {
          "text": "Auto-Open Edit Tool - Single component selected + wrench press now automatically opens the edit menu.",
          "userFacing": true,
          "editNotes": ""
        }
      ],
      "bugFixes": [
        {
          "text": "Fixed iOS file picker for importing project zip files. Various stability improvements and performance optimizations.",
          "userFacing": true,
          "editNotes": ""
        }
      ]
    }
  ]
}